app/controllers/store_controller.rb

  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2010-10-22 04:04:39.690096', 1, 1, 1, 29.95, '2010-10-22 04:04:39.690096') RETURNING "id"
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES(E'Spencer Poplin', E'3021 River Hill Ln.