app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES(E'Spencer', E'702628360551000.0338495526682513', '2010-10-26 02:16:59.340793', '2010-10-26 02:16:59.340793', E'30171d556a4df105d9588b898ec2f9553919bade') RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def update
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 2
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy